# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [30]:
import pandas as pd
import numpy as np
import random

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [20]:
lista=[]
listb=[]
listc=[]
for i in range(100):
    lista.append(random.randint(1,4))
    listb.append(random.randint(1,3))
    listc.append(random.randint(10000,30000))
a=pd.Series(lista,name='a')
b=pd.Series(listb,name='b')
c=pd.Series(listc,name='c')

### Step 3. Let's create a DataFrame by joinning the Series by column

In [23]:
df=pd.DataFrame({'a':a,'b':b,'c':c})

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [27]:
df.rename(columns={'a':'bedrs','b':'bathrs','c':'price_sqr_meter'},inplace=True)
df.head()

   bedrs  bathrs  price_sqr_meter
0      4       2            14956
1      2       1            17950
2      2       3            18520
3      1       1            28262
4      1       1            23064

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [37]:
bigcolumn=pd.concat([a,b,c])

count      300.000000
mean      6791.446667
std      10167.418096
min          1.000000
25%          2.000000
50%          3.000000
75%      15509.500000
max      29872.000000
dtype: float64

### Step 6. Ops it seems it is going only until index 99. Is it true?

In [39]:
bigcolumn

0         4
1         2
2         2
3         1
4         1
5         2
6         2
7         3
8         3
9         2
10        4
11        3
12        1
13        2
14        2
15        4
16        1
17        2
18        2
19        2
20        3
21        4
22        2
23        2
24        3
25        4
26        2
27        4
28        2
29        3
      ...
70    21772
71    16528
72    22759
73    12449
74    22813
75    14934
76    24219
77    29747
78    11570
79    24695
80    26682
81    28060
82    17781
83    14650
84    20061
85    19155
86    16098
87    29174
88    25199
89    26365
90    18045
91    16223
92    17383
93    29740
94    24230
95    26844
96    27988
97    16597
98    24193
99    11287
Length: 300, dtype: int64

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [44]:
bigcolumn.reset_index(drop=True)

0          4
1          2
2          2
3          1
4          1
5          2
6          2
7          3
8          3
9          2
10         4
11         3
12         1
13         2
14         2
15         4
16         1
17         2
18         2
19         2
20         3
21         4
22         2
23         2
24         3
25         4
26         2
27         4
28         2
29         3
       ...
270    21772
271    16528
272    22759
273    12449
274    22813
275    14934
276    24219
277    29747
278    11570
279    24695
280    26682
281    28060
282    17781
283    14650
284    20061
285    19155
286    16098
287    29174
288    25199
289    26365
290    18045
291    16223
292    17383
293    29740
294    24230
295    26844
296    27988
297    16597
298    24193
299    11287
Length: 300, dtype: int64